/* Какое будет выведено значение: let x = 5; alert( x++ ); ? Ответ 5

Чему равно такое выражение: [ ] + false - null + true ? ответ NaN (Not a Number) пустой массив особенность

Что выведет этот код: let y = 1; let x = y = 2; alert(x); ? Ответ 2 последовательное присваивание

Чему равна сумма [ ] + 1 + 2? Ответ 12 из за приведения типов данных к строке

Что выведет этот код: alert( "1"[0] )? Ответ 1

Чему равно 2 && 1 && null && 0 && undefined ?  Ответ null , оператор && запинается на лжи

Есть ли разница между выражениями? !!( a && b ) и (a && b)? Ответ false !! = превращают в булиновое значение

                                        3
Что выведет этот код: alert( null || 2 && 3 || 4 ); ? Ответ 3 оператор || запинается на правде

a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ? Ответ нет, это разные хранилища информации

Что выведет этот код: alert( +"Infinity" ); ? Ответ Infinity

Верно ли сравнение: "Ёжик" > "яблоко"? Ответ false - особенности юникода

Чему равно 0 || "" || 2 || undefined || true || falsе ? Ответ 2 , || запнулось на правду */ 

/* let x = 5; alert( x++ ) если будет так 
let x = 5; alert( ++x) то 6   */ 

/* console.log([] + false - null + true); */

/* let y = 1; 
let x = y = 2; 
alert(x) */

/* console.log([ ] + 1 + 2) */

/* console.log(2 && 1 && null && 0 && undefined); */